# PathReinforcementWrongHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..PathReinforcementWrongHost Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Path Reinforcement can be placed only in Structural Floors and straight Structural Walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathReinforcementWrongHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinforcementWrongHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathReinforcementWrongHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace